<template>
  <div class="Middle">
    <div class="top-right">
      <div>
        <p class="week">{{ weekName }}</p>
        <p class="day">{{ dayName }}</p>
      </div>
      <div class="time">{{ nowtime }}</div>
    </div>
    <div ref="mapChart" class="mapChart" />
  </div>
</template>

<script>
import echarts from '../../utils/bigData/echartsImport' //  按需引入echarts，降低打包体积
import mapOptions from './mapOptions'
import convert from '../../utils/bigData/convert' // 引入js公共方法

export default {
  components: {},
  data() {
    return {
      mapChart: null,
      weekName: '',
      dayName: '',
      nowtime: ''
    }
  },
  created() {
    this.getTime()
    setInterval(() => {
      this.getTime()
    }, 1000)
  },
  mounted() {
    this.mapChart = echarts.init(this.$refs.mapChart) //    地图
    this.getChart()
  },
  methods: {
    getTime() {
      const date = new Date()
      const weekArr = ['星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六']
      this.weekName = weekArr[date.getDay()]
      this.dayName = convert.convertDate(date, 5)
      this.nowtime = convert.convertDate(date, 4)
    },
    getChart() {
      const data = [
        {
          name: '果洛藏族自治州',
          num: 3013,
          value: [
            [99.349391, 33.826348],
            [99.294199, 33.956765],
            [99.616152, 33.895417],
            [98.569806, 34.238007],
            [100.216364, 33.993169],
            [100.216364, 33.993169],
            [99.56326, 33.693807],
            [98.992943, 33.770668],
            [99.820822, 34.016153],
            [98.94695, 34.153925],
            [98.94695, 34.153925],
            [99.857616, 33.755301],
            [98.707785, 34.016153],
            [98.707785, 34.016153],
            [99.857616, 33.516765],
            [99.977199, 33.354798],
            [99.646047, 33.716873],
            [98.974546, 33.72456],
            [98.94695, 33.931848],
            [100.151973, 34.413542],
            [99.618452, 33.732246],
            [99.56326, 33.72456],
            [99.572458, 33.655351]
          ]
        },
        {
          name: '玉树藏族自治州',
          num: 2489,
          value: [
            [95.692928, 32.355148],
            [94.570693, 33.124822],
            [93.016122, 33.093855],
            [95.95049, 32.573514],
            [96.336834, 33.618802],
            [94.129158, 33.672659],
            [92.988526, 34.018068],
            [92.988526, 34.018068],
            [96.014881, 34.795756],
            [93.733616, 33.949099],
            [93.577239, 33.541804],
            [93.917589, 33.795632],
            [93.917589, 33.795632],
            [97.17851, 34.552562],
            [97.210705, 35.64124],
            [96.29544, 34.909506],
            [96.29544, 34.909506],
            [96.29544, 34.909506],
            [96.231049, 34.784373]
          ]
        },
        {
          name: '海西蒙古族藏族自治州',
          num: 2489,
          value: [
            [98.967858, 37.313031],
            [99.003503, 37.29466],
            [99.067893, 37.313031],
            [98.882196, 37.328643],
            [99.113312, 37.297875],
            [92.811452, 37.662703],
            [98.823554, 37.229866],
            [98.823554, 37.229866],
            [98.747091, 37.263878],
            [93.050617, 36.846501],
            [92.793054, 36.994222],
            [93.050617, 36.846501],
            [92.271764, 33.035293],
            [91.78503, 32.964575],
            [91.78503, 32.964575]
          ]
        },
        {
          name: '海北藏族自治州',
          num: 1834,
          value: [
            [100.233746, 38.17657],
            [100.118188, 38.139799],
            [100.050923, 38.215137],
            [100.150923, 38.315137],
            [100.389548, 38.289038],
            [100.389548, 38.289038],
            [100.389548, 38.289038],
            [100.16111, 35.65941],
            [100.127961, 38.277255],
            [100.139263, 35.656125],
            [100.150923, 38.115137],
            [100.387823, 38.19563]
          ]
        },
        {
          name: '黄南藏族自治州',
          num: 1703,
          value: [
            [101.467847, 35.041068],
            [101.440251, 34.967269],
            [101.268351, 35.072743],
            [101.501192, 35.099209],
            [101.744381, 34.987145],
            [101.531088, 34.897192],
            [101.182689, 34.983832],
            [101.5597, 34.755044],
            [101.327434, 34.705679],
            [100.964088, 34.774972],
            [101.920747, 34.883065],
            [101.609143, 34.613515]
          ]
        },
        {
          name: '海南藏族自治州',
          num: 1179,
          value: [
            [99.929993, 35.580542],
            [100.109367, 35.648147],
            [99.539051, 35.33593],
            [100.02198, 35.431982],
            [99.973687, 35.614352],
            [100.412923, 35.730699],
            [99.734522, 35.64627],
            [100.113966, 35.662694],
            [99.902398, 35.501125]
          ]
        }
      ]
      this.mapChart.setOption(mapOptions.setMapOption(data))
    }
  }
}
</script>

<style lang="scss" scoped>
.Middle {
  display: flex;
  flex-direction: column;
  position: relative;
  > div {
    flex: 1;
  }
  .mapChart {
    height: 745px;
  }
  .top-right {
    color: #00ffff;
    position: absolute;
    right: 15px;
    font-size: 24px;
    display: flex;
    align-items: center;
    z-index: 999;
    > div {
      float: left;
      text-align: center;
    }
    .day {
      font-size: 19px;
    }
    .time {
      margin-left: 10px;
      font-size: 35px;
    }
  }
}
</style>
